{
	"entries":[
		{
		"date":"06/1/2015",
		"title":"Blog Post 1",
		"text":"Today was the first day of the Helium group of students, and it started off with the accounts not working! Though my account was in a different place before so I guess I have to cut the IT guy some slack on that one. We set up our source control today, id est github and then configured our setups, made all the accounts and such. All that good stuff. We also made a twitter bot today using the tweepy api! I am trolling people with various simpsons quotes, latin idioms, and posts about how awesome dave is, and how much like bacon he is. I had a good day today, I enjoyed meeting everyone so that was fun. I also got to teach people how git works. WOO! Teaching is fun."
		},
		{
		"date":"06/2/2015",
		"title":"Blog Post 2",
		"text":"Today was the second and equally awesome day of awesomeness. I worked on the labs, we covered conditional statements today and started working with if/elif/else statements. I took a lot of notes and all that jazz. But the highlight of my day was starting work on a SSListenBot/Exploit Deployment system as a proof of concept bot that has various exploits hard coded into it. I am building it in python and basically leanred most of the SSL record formats along with the 4 record types and started building my own heartbeat and client hello requests. I am surprised I made so much progress today. It was quite Awesome! I also helped some of the other students with various concepts and labs."
		},
		{
		"date":"06/3/2015",
		"title":"Blog Post 3",
		"text":"It was another resoundingly awesome day here at devcodecamp, I got a lot done again. I made a lot more progress on my SSListener, having added a fatal unexpected message that will only be sent when I tell the bot to closing the connection, but the bot keeps sending to keep the server occupied and thus offline by proxy. We also are making a new dice game and I decided to rewrite mine from scratch in an object oriented way using classes to have as many players as I want and redefined the rules with the other students so its interesting doing it again.	I have most of my game logic done, and am now working on the class object for the players and am working out how to play against the CPU. Hopefully I will make more progress when I get home but I am kind of spent, and I am not entirely sure why. Maybe its from doing hexadecimal math in my head when I was building the SSL records to be sent. Its one of those things thats pretty easy but at the same time really complicated depending on what I am modifying or adding to the request to be sent. Im hoping I can get everything working with that by the end of the week so I can start testing it and adding and improving functionality. But ya twas' a great day~!"
		},
		{
		"date":"06/4/2015",
		"title":"Blog Post 4",
		"text":"Well today was pretty great as well. I made some progress on my dicewar program and started again writing it in an object oriented way instead of it being almost entirely conditional. so huzzur. I also got to work on my SSListener a bit more. I just realized if you pronounce that exactly as it sounds it is SS-Listener, like you are listening to what the German SS is talking about. Ha. I also learned a few things I didnt the first time around such as the strip(), l/rstrip() which allow you to remove whitespace or whatever you put inside the () so that was pretty cool. I am going to continue working on the dice game tonight as well as some other things should I have enoug time to do so. Other than that I am going to try and relax tonight and get as much as I can done before friday, but I am not behind, I just want to keep working! :)"
		},
		{
		"date":"06/5/2015",
		"title":"Blog Post 5",
		"text":"I had a really really productive day today. I started really understanding the concepts of object oriented programming and I now have some really good id3as for my dice game mainily making everything classes, the player, the dice, the game, and making all my functions methods of those classes instead of having just free floating functions errywhere and having a small two line file that initializes the game similar to my bot which just calls all the other files in the correct sequence(for lack of a better word) and thats that. So Im quite happy with that, Im also really happy with andrews style of teaching and how he is letting us just roll with our dice game because he sees that we are learning a lot of concepts from it instead of stopping us and moving us to the next thing. In general Im happy that I started the program over again. So ye, I shall return on the morrow with more musings."
		}

	]
}